<div style="font-size: 36pt;">
    Lecture 2 Examples
</div>

# Set Up Environment

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [3]:
%sql use db_book;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

# Relational Algebra

```
/*
	Get the names and salaries of instructors in the Computer Science Department
	with a salary >= 75000
*/
π instructor_name←name, instructor_salary←salary (
	σ salary>=75000∧dept_name='Comp. Sci.' (instructor)
)
```

```
/*
	Get the instructor ID, instructor name, course_id, sec_id, semester and year
	from every possible combination of instructor X teaches where the 
	instructor ID and the teached ID are equal
*/
π ID←instructor.ID, 
	name←instructor.name,
	course_id←teaches.course_id,
	sec_id←teaches.sec_id,
	semester←teaches.semester,
	year←teaches.year
(
	σ instructor.ID=teaches.ID (instructor ⨯ teaches)
)
```

```
/*
	Instructors are versatile. An instructor in a department whould be able
	to teach any course offered by the department. For the Comp Sci department
	get every possible combination and course to see who can teach what.
*/
π ID←instructor.ID, 
	name←instructor.name, 
	course_id←course.course_id, 
	title←course.title
	(
	(σ dept_name='Comp. Sci.' (instructor))
	⨯
	(σ dept_name='Comp. Sci.' (course))
)
```

# SQL

In [ ]:
```
drop table if exists Department;
drop table if exists School;

CREATE TABLE `School` (
  `school_code` char(4) not null,
  `school_name` varchar(64) not null,
  PRIMARY KEY (`school_code`)
);

CREATE TABLE `Department` (
  `school_code` char(4) not null,
  `department_code` char(4) not null,
  `department_name` varchar(64) not null,
  PRIMARY KEY (`department_code`),
    FOREIGN KEY (`school_code`)
      REFERENCES `School`(`school_code`)
);

drop table if exists Room;
drop table if exists Building;

CREATE TABLE `Building` (
  `building_code` char(4) not null,
  `building_name` varchar(128) not null,
  PRIMARY KEY (`building_code`)
);

CREATE TABLE `Room` (
  `room_id` int auto_increment primary key,
  `building_code` char(4) not null,
  `room_no` char(8) not null,
  `capacity` int not null,
    unique key (building_code, room_no),
    check ( capacity > 0 )
);


drop table if exists Faculty;

CREATE TABLE `Faculty` (
  `UNI` varchar(16),
  `last_name` varchar(128) not null,
  `first_name` varchar(128) not null,

    /* Middle name may be NULL */
  `middle_name` varchar(128),
  `email` varchar(256) not null,
    department_code char(4) not null,
  PRIMARY KEY (`UNI`),
    unique key (email),
    foreign key (department_code)
                       references Department(department_code)
);

CREATE TABLE `Student` (
  `UNI` varchar(16) not null,
  `last_name` varchar(128) not null,
  `first_name` varchar(128) not null,
  `middle_name` varchar(128),
  `email` varchar(256) not null,
  `CUID` varchar(16) not null,
    school_code char(4) not null,
  PRIMARY KEY (`UNI`),
    unique key(cuid),
  FOREIGN KEY (`school_code`)
      REFERENCES `School`(`school_code`)
);

CREATE TABLE `Course` (
  `department_code` char(4) not null,
  `faculty_code` char(1) not null,
  `course_no` char(4) not null,
  `course_title` varchar(128) not null,
  `course_description` varchar(2048) not null,
  PRIMARY KEY (`department_code`, `faculty_code`, `course_no`),
  FOREIGN KEY (`department_code`)
      REFERENCES `Department`(`department_code`)
);

CREATE TABLE `Section` (
  `callno` <type>,
  `department_code` <type>,
  `faculty_code` <type>,
  `course_no` <type>,
  `section_no` <type>,
  `semester` <type>,
  `year` <type>,
  `time_slot_id` <type>,
  `room_id` <type>,
  `instructor_uni` <type>,
  PRIMARY KEY (`callno`),
  FOREIGN KEY (`department_code`)
      REFERENCES `Room`(`building_code`),
  FOREIGN KEY (`department_code`)
      REFERENCES `Faculty`(`first_name`)
);





CREATE TABLE `StudentSection` (
  `UNI` <type>,
  `callno` <type>,
  `role` <type>,
  `status` <type>,
  PRIMARY KEY (`UNI`, `callno`, `role`),
  FOREIGN KEY (`UNI`)
      REFERENCES `Section`(`year`),
  FOREIGN KEY (`UNI`)
      REFERENCES `Student`(`UNI`)
);





```